package main

import "ws"

/*
在一个10*10的大表格里，边界是墙，随机选择50个格子，每个格子里撒下1颗豆子
再设置一个吃豆人，视野只能看见前后左右四个格子的情况
每个格子有三种情况，要么是空的，要么是豆子，要么是墙
得分规则
*吃豆人吃到豆得10分
*移动位置不扣分也不得分
*执行了吃的动作但是格子里没有豆子扣1分
*如果撞墙了扣5分，撞完墙会回到离墙最近的格子里面

吃豆人可以做的动作有七种
*上下左右移动4种
*随机移动
*不动
*吃豆

吃豆人的生存策略
* 吃豆人能观察到自己格子以及前后左右共5个格子的情况
* 每个格子有三种情况，要么是空的，要么是豆子，要么是墙
* 那么吃豆人能观察到的情况一种3^5 = 243种情况
* 在这243种情况下有7种行动可以选择[向上走，向下走，向左走，向右走，随机走，不动，吃豆]

随机生成200个生存策略，也就是200个人，
进行1000场吃豆的挑战赛，每场的50个豆子都是随机撒下去的
每场比赛可以200个行动
评估平均每走100步得到的分数是多少

亮点来了
200个个体中，按照得分的高低，分配一个随机数，从200个个体中选择2个个体，得分越高，被选中概率越高
再分配一个随机数，在243位中选择1个切断位，假设这个随机数是50，那么
选中的2个个体A和B，A的[0,50]与B的[51,243]拼成一个新的策略 & A的[51,243]与B的[0,50]拉成一个新的策略
生成的新策略，还有一个非常低的概率发生遗传变异,243位里面会有那么几位随机地变成其他数

用随机数,不断挑出2个父母,不断生成2个孩子,当孩子的数量增加到200,开始第二轮的吃豆挑战赛
*/

func main() {
	ws.Start()
	// ws.OnePlayerStart("3;5;5;1;1;3;4;5;5;2;5;3;1;1;1;2;5;1;1;5;0;1;5;6;4;3;5;1;5;2;1;5;6;3;0;6;2;3;2;1;1;6;4;5;1;3;5;3;1;5;1;3;3;4;1;5;5;1;5;6;4;5;4;2;5;2;2;5;0;4;5;0;1;5;2;0;1;5;0;0;2;4;5;4;4;1;6;4;5;3;4;5;1;2;1;1;4;5;3;4;5;5;0;1;6;3;2;3;4;3;1;4;1;1;6;6;4;6;3;1;0;3;1;1;3;2;3;3;0;3;3;0;1;2;0;4;5;1;4;5;0;4;5;2;4;5;4;4;5;6;4;5;0;4;5;5;4;5;4;6;2;3;2;5;5;3;5;2;2;5;6;2;5;1;3;5;3;2;5;0;3;5;6;3;1;6;5;3;4;3;5;2;3;3;0;4;2;0;2;5;4;2;5;4;0;4;1;3;5;0;5;1;5;5;4;3;1;6;6;1;6;0;6;1;1;0;2;2;0;5;6;4;2;2;6;1;2;3;2;4;3;4;6")
}
